#include <stdio.h>
#include <math.h>
#define pi 3.1415926535

int main(){
/*------------------------------*/
//本实验相关的实验常数 
	double doil=981,dair=1.293;
	double g=9.794;
	double n=1.83e-5;
	double l=0.002;
	double b=8.22e-3;
	double p=10130;
	double d=0.005;
	double q0=1.602e-19;
/*------------------------------*/ 
	int i,N;
	double u[100],t[100],vf[100],r0[100],q[100];//定义电压、时间、速度、半径、电量数组 
	printf("共测得几组数据：\n");
	scanf("%d",&N); //输入测量的油滴组数 
	printf("输入各组油滴电压u和匀速下降时间t，每组占一行\n");
	for(i=0;i<N;i++){
		scanf("%lf %lf",&u[i],&t[i]);//输入各组油滴匀速下降时的电压和下降所需时间 
	}
/*-----------------------------*/
//计算各组油滴的速度、半径、电量，存储于数组中
	for(i=0;i<N;i++){
		vf[i]=l/t[i];
		r0[i]=sqrt((9*vf[i]*n)/(2*(doil-dair)*g));
		q[i]=9*sqrt(2.0)*pi*(d/u[i])*sqrt(1/((doil-dair)*g))*pow((n*l)/((1.0+b/(p*r0[i]))*t[i]),1.50)*1e19;
	}
/*-----------------------------*/
	printf("输出各组油滴序号、时间、速度、半径、电量：\n");
/*-----------------------------*/
//遍历各组数据，输出时间、速度、半径、电量 
	for(i=0;i<N;i++){
		printf("序号%02d--时间：%lf，速度：%lf，半径：%lf，电量：%lf\n",i+1,t[i],vf[i]*10000,r0[i]*1000000,q[i]);
	}
/*-----------------------------*/
	return 0; 
}


